# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/bundle"
tap "1password/tap"

# Brew CLI apps
brew "diff-so-fancy"
brew "git-extras"
brew "go"
brew "jq"
brew "neovim"
brew "node"
brew "postgresql"
brew "tmux"
brew "nvm"
brew "jenv"
brew "git"
brew "ripgrep" #telescope
brew "fd" #telescope
brew "intellij-idea"
brew "stow" #otherwise this wouldn't make sense =D

#set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# App casks
cask "1password-cli"
cask "adobe-creative-cloud"
cask "google-chrome"
cask "obsidian"
cask "postman"
cask "zoom"
cask "spotify"
cask "wezterm"
cask 
# Font casks
cask "font-hack-nerd-font"
